scarab/history.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-11 月 13:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Scarab: history</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Takehide Soh" />
<link rel="stylesheet" type="text/css" href="../myhome.css" />
</head>
<body>
<div id="content">
<h1 class="title">Scarab: history</h1>
<blockquote>
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-6313627-2']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</div>

<table class="menu" border="0" cellspacing="0" cellpadding="20" width="900px">
<tr>
<td class="menu" bgcolor="#3B5998"><a href="index.html">Home</a></td>
<td class="menu" bgcolor="#3B5998"><a href="examples.html">Examples</a></td>
<td class="menu" bgcolor="#3B5998"><a href="doc.html">Documents</a></td>
<td class="menu" bgcolor="#3B5998"><a href="advanced.html">Advanced Usage</a></td>
<td class="menu" bgcolor="#3B5998"><a href="tutorial.html">Tutorial</a></td>
<td class="menu" bgcolor="#3B5998"><a href="apps.html">Apps</a></td>
</tr>
</table>

<div id="content">
</blockquote>

<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39">History</h2>
<div class="outline-text-2" id="text-orgheadline39">
</div><ul class="org-ul"><li><a id="orgheadline1"></a>[2016.07.03] <a href="./scarab-v1-8-9.zip">ZIP of Scarab Package</a> &#x2013; Version 1.8.9 is released.<br  /><div class="outline-text-3" id="text-orgheadline1">
<ul class="org-ul">
<li>Some bug fix.</li>
<li>Makefile and build.sbt are fixed and work correctly.</li>
</ul>
</div></li>

<li><a id="orgheadline2"></a>[2015.06.14] <a href="./scarab-v1-6-9.zip">ZIP of Scarab Package</a> &#x2013; Version 1.6.9 is released.<br  /><div class="outline-text-3" id="text-orgheadline2">
<ul class="org-ul">
<li>changes will be updated soon.</li>
</ul>
</div></li>

<li><a id="orgheadline3"></a>[2015.05.25] <a href="./scarab168.jar">JAR of Scarab</a> &#x2013; Version 1.6.8 is released.<br  /><div class="outline-text-3" id="text-orgheadline3">
<ul class="org-ul">
<li>changes will be updated soon.</li>
</ul>
</div></li>
<li><a id="orgheadline4"></a>[2015.02.08] <a href="./scarab-v1-5-7.jar">JAR of Scarab</a> &#x2013; Version 1.5.7 is released.<br  /><div class="outline-text-3" id="text-orgheadline4">
<ul class="org-ul">
<li>To run this version, Scala 2.11.* or higher is required.</li>
<li>Addition of new functions.
<ul class="org-ul">
<li>UNSAT Core dectection in CSP level.</li>
<li>Nested commit.</li>
<li>Built-in optimization function.</li>
</ul></li>
<li>Refactoring for some parts.</li>
</ul>
</div></li>

<li><a id="orgheadline5"></a>[2015.01.09] <a href="./scarab-v1-5-6.jar">JAR of Scarab</a> &#x2013; Version 1.5.6 is released.<br  /><div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li>To run this version, Scala 2.11.* or higher is required.</li>
<li>Support non-contiguous domain.</li>
<li>Performance improvement.
<ul class="org-ul">
<li>Order Encoding Module is tuned.</li>
<li>Native PB Constraint is tuned.</li>
</ul></li>
</ul>
</div></li>



<li><a id="orgheadline8"></a>[2014.07.05] <a href="./scarab-v1-1-2.zip">Scarab &#x2013; Version 1.1.2</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline6"></a>Native BC and Natice PB are implemented on Scarab.<br  /></li>
<li><a id="orgheadline7"></a>some bug fix.<br  /></li></ul></li>

<li><a id="orgheadline10"></a>[2014.07.01] <a href="./scarab-v1-1-1.zip">Scarab &#x2013; Version 1.1.1</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline9"></a>it is adopted to Scala 2.11.*<br  /></li></ul></li>
<li><a id="orgheadline12"></a>[2014.05.27] <a href="./scarab-v1-1-0.zip">Scarab &#x2013; Version 1.1.0</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline11"></a>bug fix (in the case constraint includes some obvious domain inconsitency).<br  /></li></ul></li>
<li><a id="orgheadline14"></a>[2014.01.31] <a href="./scarab-v1-0-8.zip">Scarab &#x2013; Version 1.0.8</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline13"></a>some bug fix.<br  /></li></ul></li>
<li><a id="orgheadline17"></a>[2013.12.25] <a href="./scarab-v1-0-6.zip">Scarab &#x2013; Version 1.0.6</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline15"></a>It supports boolInt type.<br  /></li>
<li><a id="orgheadline16"></a>It supports external SAT solvers like minisat, glucose, and lingeling.<br  /></li></ul></li>

<li><a id="orgheadline21"></a>[2013.11.25] <a href="./scarab-v1-0-4.zip">Scarab &#x2013; Version 1.0.4</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline18"></a>Native Encoder is updated.<br  /></li>
<li><a id="orgheadline19"></a>Sat4j included in Scarab JAR is updated.<br  /></li>
<li><a id="orgheadline20"></a>This version is written in about 800 lines of Scala without comments.<br  /></li></ul></li>

<li><a id="orgheadline26"></a>[2013.10.04] <a href="./scarab-v1-0-3.zip">Scarab &#x2013; Version 1.0.3</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline22"></a>Internally, Constraints are now represented by using LeZero, GeZero, EqZero, NeZero, Bool, and Not <br>(Until 1.0.2, all of constraints are represented by using only LeZero, Bool, Not).<br  /></li>
<li><a id="orgheadline23"></a>Addition to OrderEncoder, NativeEncoder is now available, which directly passes Boolean cardinality constraints to Sat4j without SAT encoding.<br  /></li>
<li><a id="orgheadline24"></a>This version introduces many Sat4j configurations: &ldquo;MiniLearningHeap&rdquo;, &ldquo;MiniLearningHeapEZSimp&rdquo;, &ldquo;Glucose21&rdquo;, &ldquo;BestWL&rdquo;, &ldquo;BestHT&rdquo;, &ldquo;SAT&rdquo;, &ldquo;UNSAT&rdquo;, &ldquo;greedy&rdquo; etc<br  /></li>
<li><a id="orgheadline25"></a>You can use it by defining SAT solvers like: new Sat4j(&ldquo;MiniLearningHeap&rdquo;)<br  /></li></ul></li>
<li><a id="orgheadline30"></a>[2013.09.14] <a href="./scarab-v1-0-2.zip">Scarab &#x2013; Version 1.0.2</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline27"></a><a href="http://www.sat4j.org/">Sat4j</a> verion 2.3.5 is now included<br  /></li>
<li><a id="orgheadline28"></a>some bug fix is done<br  /></li>
<li><a id="orgheadline29"></a>&ldquo;findNext&rdquo; of solver is introduced for enumerating solutions (enumeration feature of &ldquo;find&rdquo; is dismounted).<br  /></li></ul></li>
<li><a id="orgheadline31"></a>[2013.07.08-12] Scarab is presented at <a href="http://www.satcompetition.org/PoS13/">PoS-13</a> and <a href="http://sat2013.cs.helsinki.fi/">SAT</a> (paper for the PoS workshop is available <a href="./pos2013scarab.pdf">here</a>).<br  /></li>
<li><a id="orgheadline32"></a>[2013.05.27] We have move examples (see <a href="./examples.html">Examples</a>)<br  /></li>
<li><a id="orgheadline35"></a>[2013.04.20] <a href="./scarab-v1-0-1.zip">Scarab &#x2013; Version 1.0.1</a> is released<br  /><ul class="org-ul"><li><a id="orgheadline33"></a><a href="http://www.sat4j.org/">Sat4j</a> verion 2.3.3 is now included<br  /></li>
<li><a id="orgheadline34"></a>ModelIterator of Sat4j is <a href="./examples.html">available</a> to use<br  /></li></ul></li>
<li><a id="orgheadline36"></a>[2013.04.12] Web page is re-organized<br  /></li>
<li><a id="orgheadline37"></a>[2013.04.12] Class diagrams are added to <a href="./doc.html">Documents</a><br  /></li>
<li><a id="orgheadline38"></a>[2013.03.25] Magic Square is added to <a href="./examples.html">Examples</a><br  /></li></ul>
</div>


<div id="outline-container-orgheadline40" class="outline-2">
<h2 id="orgheadline40">Old versions</h2>
<div class="outline-text-2" id="text-orgheadline40">
<p>
Since Scala is not binary comaptible in major versions, the following
older version may need re-compile accorinding to your environment.
</p>
</div>
<ul class="org-ul"><li><a id="orgheadline41"></a><a href="./scarab-v1-1-1.zip">version 1.1.1</a><br  /></li>
<li><a id="orgheadline42"></a><a href="./scarab-v1-1-0.zip">version 1.1.0</a><br  /></li>
<li><a id="orgheadline43"></a><a href="./scarab-v1-0-8.zip">version 1.0.8</a><br  /></li>
<li><a id="orgheadline44"></a><a href="./scarab-v1-0-6.zip">version 1.0.6</a><br  /></li>
<li><a id="orgheadline45"></a><a href="./scarab-v1-0-4.zip">version 1.0.4</a><br  /></li>
<li><a id="orgheadline46"></a><a href="./scarab-v1-0-3.zip">version 1.0.3</a><br  /></li>
<li><a id="orgheadline47"></a><a href="./scarab-v1-0-2.zip">version 1.0.2</a><br  /></li>
<li><a id="orgheadline48"></a><a href="./scarab-v1-0-1.zip">version 1.0.1</a><br  /></li></ul>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Takehide Soh</p>
<p class="date">Created: 2019-02-11 月 13:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
